-- Isle of Conquest
-- use these 2 queries only if you want to enable IoC by direct queueing it
-- DELETE FROM battleground_template WHERE id = 30;
-- INSERT INTO battleground_template (id, MinPlayersPerTeam, MaxPlayersPerTeam, AllianceStartLoc, AllianceStartO, HordeStartLoc, HordeStartO) VALUES
-- (30, 10, 40, 1485, 0, 1486, 3.14159);

DELETE FROM mangos_string WHERE entry BETWEEN 20060 AND 20082;
INSERT INTO mangos_string (entry, content_default, content_loc6, content_loc7, content_loc8) VALUES
(20060, 'The battle will begin in 2 minutes.', 'La batalla por la Isla de la Conquista comenzará en 2 minutos.', 'La batalla por la Isla de la Conquista comenzará en 2 minutos.', 'Бой на Острове Завоеваний начнется через 2 минуты!'),
(20061, 'The battle will begin in 1 minute.', 'La batalla por la Isla de la Conquista comenzará en 1 minuto.', 'La batalla por la Isla de la Conquista comenzará en 1 minuto.', 'Бой на Острове Завоеваний начнется уже через 1 минуту! Начинайте готовиться!'),
(20062, 'The battle will begin in 30 seconds!', 'La batalla por la Isla de la Conquista comenzará en 30 segundos. ¡Preparaos!', 'La batalla por la Isla de la Conquista comenzará en 30 segundos. ¡Preparaos!', 'Бой на Острове Завоеваний начнется через 30 секунд! Будьте готовы!'),
(20063, 'The battle has begun!', '¡La batalla por la Isla de la Conquista ha comenzado!', '¡La batalla por la Isla de la Conquista ha comenzado!', 'Бой начался!'),
(20064, 'Alliance Keep', 'Fortaleza de la Alianza', 'Fortaleza de la Alianza', 'крепость Альянса'),
(20065, 'Horde Keep', 'Fortaleza de la Horda', 'Fortaleza de la Horda', 'крепость Орды'),
(20066, 'The Alliance wins!', '¡Gana la Alianza!', '¡Gana la Alianza!', 'Альянс побеждает!'),
(20067, 'The Horde wins!', '¡Gana la Horda!', '¡Gana la Horda!', 'Орда побеждает!'),
(20068, 'The west gate of the Alliance has been destroyed!', '¡La puerta oeste de la fortaleza de la Alianza ha sido destruida!', '¡La puerta oeste de la fortaleza de la Alianza ha sido destruida!', 'Восточные врата Альянса разрушены!'),
(20069, 'The east gate of the Alliance has been destroyed!', '¡La puerta este de la fortaleza de la Alianza ha sido destruida!', '¡La puerta este de la fortaleza de la Alianza ha sido destruida!', 'Западные врата Альянса разрушены!'),
(20070, 'The front gate of the Alliance has been destroyed!', '¡La puerta central de la fortaleza de la Alianza ha sido destruida!', '¡La puerta central de la fortaleza de la Alianza ha sido destruida!', 'Южные врата Альянса разрушены!'),
(20071, 'The west gate of the Horde has been destroyed!', '¡La puerta oeste de la fortaleza de la Horda ha sido destruida!', '¡La puerta oeste de la fortaleza de la Horda ha sido destruida!', 'Восточные врата Орды разрушены!'),
(20072, 'The east gate of the Horde has been destroyed!', '¡La puerta este de la fortaleza de la Horda ha sido destruida!', '¡La puerta este de la fortaleza de la Horda ha sido destruida!', 'Западные врата Орды разрушены!'),
(20073, 'The front gate of Horde has been destroyed!', '¡La puerta central de la fortaleza de la Horda ha sido destruida!', '¡La puerta central de la fortaleza de la Horda ha sido destruida!', 'Южные врата Орды разрушены!'),
(20074, '$n has assaulted the %s', '¡$n ha asaltado %s!', '¡$n ha asaltado %s!', '$n захватывает %s'),
(20075, '$n has defended the %s', '¡$n ha defendido %s!', '¡$n ha defendido %s!', '$n отбивает и возвращает под свой контроль %s'),
(20076, '$n claims the %s! If left unchallenged, the %s will control it in 1 minute!', '¡$n reclama %s! ¡Si nadie se lo impide, la %s tomará el control en 1 minuto!' , '¡$n reclama %s! ¡Si nadie se lo impide, la %s tomará el control en 1 minuto!', '$n захватывает %s! Если ничего не предпринимать, %s получит контроль уже через 1 минуту!'),
(20077, 'The %s has taken the %s', 'La %s ha tomado %s.', 'La %s ha tomado %s.', '%s захватывает %s'),
(20078, 'Workshop', 'el Taller', 'el Taller', 'Мастерская'),
(20079, 'Docks', 'los Muelles', 'los Muelles', 'Причал'),
(20080, 'Refinery', 'la Refinería', 'la Refinería', 'Нефтезавод'),
(20081, 'Quarry', 'la Cantera', 'la Cantera', 'Каменоломня'),
(20082, 'Hangar', 'el Hangar', 'el Hangar', 'Ангар');

-- Alliance Gunship Cannon
UPDATE creature_template SET vehicle_id = 452, iconName = 'vehichleCursor', faction_A = 3, faction_H = 3, unit_flags = unit_flags & ~0x2000000, ScriptName = '' WHERE entry IN (34929, 35410);
-- Horde Gunship Cannon
UPDATE creature_template SET vehicle_id = 453, iconName = 'vehichleCursor', faction_A = 6, faction_H = 6, unit_flags = unit_flags & ~0x2000000, ScriptName = '' WHERE entry IN (34935, 35427);
-- Keep Cannon
UPDATE creature_template SET unit_flags = unit_flags | 4, vehicle_id = 160, iconName = 'vehichleCursor', faction_A = 35, faction_H = 35, unit_flags = unit_flags | 4, ScriptName = 'npc_ic_cannon' WHERE entry IN (34944, 35429);
-- Catapult
UPDATE creature_template SET speed_walk = 2.4, speed_run = 2.8, powertype = 3, vehicle_id = 438, iconName = 'vehichleCursor', faction_A = 35, faction_H = 35, speed_walk = 2.4, speed_run = 2.8, ScriptName = 'npc_ic_vehicle' WHERE entry IN (34793, 35413);
-- Demolisher
UPDATE creature_template SET vehicle_id = 509, iconName = 'vehichleCursor', faction_A = 35, faction_H = 35, ScriptName = 'npc_ic_vehicle', AIName = 'NullAI' WHERE entry IN (34775, 35415);
-- Alli Siege Engine
UPDATE creature_template SET powertype = 3, vehicle_id = 435, iconName = 'vehichleCursor', faction_A = 3, faction_H = 3, AIName = 'NullAI' WHERE entry IN (34776, 35431);
-- Horde Siege Engine
UPDATE creature_template SET powertype = 3, vehicle_id = 435, iconName = 'vehichleCursor', faction_A = 6, faction_H = 6, AIName = 'NullAI' WHERE entry IN (35069, 35433);
-- Alli Glaive Thrower
UPDATE creature_template SET vehicle_id = 447, iconName = 'vehichleCursor', faction_A = 3, faction_H = 3, ScriptName = 'npc_ic_vehicle', AIName = 'NullAI' WHERE entry IN (34802, 35419);
-- Horde Glaive Thrower
UPDATE creature_template SET vehicle_id = 447, iconName = 'vehichleCursor', faction_A = 6, faction_H = 6, ScriptName = 'npc_ic_vehicle', AIName = 'NullAI' WHERE entry IN (35273, 35421);
-- Horde/Ally Flame Turret
UPDATE creature_template SET powertype = 3, iconName = 'Gunner', vehicle_id = 437, ScriptName = '', AIName = 'NullAI' WHERE entry IN (34778, 35417, 36356, 36358);
-- Ally/horde Siege Turret
UPDATE creature_template SET powertype = 3, iconName = 'Gunner', vehicle_id = 436, ScriptName = '', AIName = 'NullAI' WHERE entry IN (34777, 35436, 36355, 36357);

UPDATE `creature_template` SET unit_flags = unit_flags & ~0x2000000 WHERE entry IN (34778, 35417, 36356, 36358, 34777, 35436, 36355, 36357);

UPDATE creature_template SET mechanic_immune_mask = mechanic_immune_mask|1|2|8|16|32|64|128|1024|2048|4096|8192|131072|262144|8388608|16777216|67108864 WHERE entry IN (34944, 35429, 34793, 35413, 34775, 35415, 34776, 35431, 35069, 35433, 34802, 35419, 35273, 35421);

DELETE FROM npc_spellclick_spells WHERE npc_entry IN (34929, 34935, 34944, 34793, 34775, 34776, 35069, 34802, 35273, 34778, 36356, 34777, 36355);
INSERT INTO npc_spellclick_spells (npc_entry, spell_id, quest_start, quest_start_active, quest_end, cast_flags) VALUES
(34929, 60968, 0, 0, 0, 1),
(34935, 60968, 0, 0, 0, 1),
(34944, 60968, 0, 0, 0, 1),
(34793, 60968, 0, 0, 0, 1),
(34793, 68362, 0, 0, 0, 3),
(34775, 60968, 0, 0, 0, 1),
(34775, 68365, 0, 0, 0, 3),
(34776, 60968, 0, 0, 0, 1),
(34776, 68364, 0, 0, 0, 3),
(35069, 60968, 0, 0, 0, 1),
(34802, 60968, 0, 0, 0, 1),
(34802, 68363, 0, 0, 0, 3),
(35273, 60968, 0, 0, 0, 1),
(35273, 68363, 0, 0, 0, 3),
(34778, 60968, 0, 0, 0, 1),
(36356, 60968, 0, 0, 0, 1),
(34777, 60968, 0, 0, 0, 1),
(36355, 60968, 0, 0, 0, 1);

-- Alliance Gunship Cannon
UPDATE `creature_template` SET `spell1` = 66518 WHERE `entry` = 34929;
UPDATE `creature_template` SET `spell1` = 69495 WHERE `entry` = 35410;
-- Horde Gunship Cannon
UPDATE `creature_template` SET `spell1` = 66529 WHERE `entry` = 34929;
UPDATE `creature_template` SET `spell1` = 68825 WHERE `entry` = 34929;
-- Keep Cannon
UPDATE `creature_template` SET `spell1` = 68170, `spell2` = 66541 WHERE `entry` = 34944;
UPDATE `creature_template` SET `spell1` = 67452, `spell2` = 68169 WHERE `entry` = 35429;
-- Catapult
UPDATE `creature_template` SET `spell1` = 66218, `spell2` = 66296 WHERE `entry` = 34793;
UPDATE `creature_template` SET `spell1` = 66218, `spell2` = 66296 WHERE `entry` = 35413;
-- Demolisher
UPDATE `creature_template` SET `spell1` = 67440, `spell2` = 67441 WHERE `entry` = 34775;
UPDATE `creature_template` SET `spell1` = 68068, `spell2` = 67442 WHERE `entry` = 35415;
-- Alli Siege Engine
UPDATE `creature_template` SET `spell1` = 67796, `spell2` = 67797 WHERE `entry` = 34776;
UPDATE `creature_template` SET `spell1` = 67816, `spell2` = 69502 WHERE `entry` = 35431;
-- Horde Siege Engine
UPDATE `creature_template` SET `spell1` = 67796, `spell2` = 67797 WHERE `entry` = 35069;
UPDATE `creature_template` SET `spell1` = 67816, `spell2` = 69502 WHERE `entry` = 35433;
-- Alli Glaive Thrower
UPDATE `creature_template` SET `spell1` = 66456, `spell2` = 67195 WHERE `entry` = 34802;
UPDATE `creature_template` SET `spell1` = 68827, `spell2` = 69515 WHERE `entry` = 35419;
-- Horde Glaive Thrower
UPDATE `creature_template` SET `spell1` = 67034, `spell2` = 67195 WHERE `entry` = 35273;
UPDATE `creature_template` SET `spell1` = 68826, `spell2` = 69515 WHERE `entry` = 35421;
-- Horde/Ally Flame Turret
UPDATE `creature_template` SET `spell1` = 68832 WHERE `entry` = 34778;
UPDATE `creature_template` SET `spell1` = 68832 WHERE `entry` = 35417;
UPDATE `creature_template` SET `spell1` = 68832 WHERE `entry` = 36356;
UPDATE `creature_template` SET `spell1` = 68832 WHERE `entry` = 36358;
-- Ally/horde Siege Turret
UPDATE `creature_template` SET `spell1` = 69505, `spell2` = 67462 WHERE `entry` = 34777;
UPDATE `creature_template` SET `spell1` = 69505, `spell2` = 67462 WHERE `entry` = 35436;
UPDATE `creature_template` SET `spell1` = 69505, `spell2` = 67462 WHERE `entry` = 36355;
UPDATE `creature_template` SET `spell1` = 69505, `spell2` = 67462 WHERE `entry` = 36357;

-- alliance boss faction
UPDATE creature_template SET faction_A = 84, faction_H = 84 WHERE entry = 34924;
-- alli boss guard faction
UPDATE creature_template SET faction_A = 84, faction_H = 84 WHERE entry = 34919;
-- horde boss faction
UPDATE creature_template SET faction_A = 83, faction_H = 83 WHERE entry = 34922;
-- horde boss guard faction
UPDATE creature_template SET faction_A = 83, faction_H = 83 WHERE entry = 34918;

-- make sure doors arent clickable
UPDATE gameobject_template SET flags = flags | 4 WHERE entry IN (195223,195703,195491,195451,195452,195437,195436);

-- alli flags in keeps
UPDATE gameobject_template SET faction = 83, flags = 0 WHERE entry IN (195397, 195396, 195392, 195391);
-- horde flags in keeps
UPDATE gameobject_template SET faction = 84, flags = 0 WHERE entry IN (195399, 195398, 195394, 195393);

-- Seaforium charges
UPDATE gameobject_template SET data2 = 1, data4 = 1, data7 = 10 WHERE entry IN (195331, 195235);

-- some people say bombs should be consumed after 3 uses, some say they dont disappear.. Im making them non-consumable
-- if huge bombs should have 3 charges, type has to be changed to spellcaster too, as goobers dont have charges
-- bombs in the horde keep
UPDATE gameobject_template SET faction = 1997, flags = 0, data5 = 0 WHERE entry IN (195333, 195232);
-- bombs in the alli keep
UPDATE gameobject_template SET faction = 1995, flags = 0, data5 = 0 WHERE entry IN (195332, 195237);

-- horde teleporters
UPDATE gameobject_template SET faction = 1995, flags = 16 WHERE entry IN (195313, 195314);
UPDATE gameobject_template SET faction = 1995 WHERE entry = 195326;
-- alliance teleporters
UPDATE gameobject_template SET faction = 1997, flags = 16 WHERE entry IN (195315, 195316);
UPDATE gameobject_template SET faction = 1997 WHERE entry = 195320;

-- scriptnames
UPDATE gameobject_template SET ScriptName = 'go_ic_teleport' WHERE entry BETWEEN 195313 AND 195316;
-- gunship portals
-- disabled till fixed
UPDATE gameobject_template SET ScriptName = 'go_ic_teleport' WHERE entry IN (195320, 195326);

-- no regeneration buff for vehicles
DELETE FROM creature_template_addon WHERE entry IN (34929, 34935, 34944, 34793, 34775, 34776, 35069, 34802, 35273, 34778, 36356, 34777, 36355);
INSERT INTO creature_template_addon (entry, auras) VALUES
(34929, 52455),
(34935, 52455),
(34944, 52455),
(34793, 52455),
(34775, 52455),
(34776, 52455),
(35069, 52455),
(34802, 52455),
(35273, 52455),
(34778, 52455),
(36356, 52455),
(34777, 52455),
(36355, 52455);

-- Achievements
DELETE FROM achievement_criteria_requirement WHERE criteria_id IN (11492, 11493, 11494, 11495, 12059, 12066, 12067, 12132, 12163);
INSERT INTO achievement_criteria_requirement VALUES
(11492, 6, 4710, 0),  -- Four Car Garage (x4)
(11493, 6, 4710, 0),
(11494, 6, 4710, 0),
(11495, 6, 4710, 0),
(12059, 6, 4710, 0),  -- Isle of Conquest All-Star
(12066, 6, 4710, 0),  -- A-bomb-inable
(12067, 6, 4710, 0),  -- A-bomb-ination
(12132, 6, 4710, 0),  -- Cut the Blue Wire... No the Red Wire!
(12163, 6, 4710, 0);  -- Back Door Job

-- SPAWNING STATIC OBJECTS

DELETE FROM gameobject WHERE map = 628;
INSERT INTO gameobject (guid, id, map, spawnMask, phaseMask, position_x, position_y, position_z, orientation, rotation0, rotation1, rotation2, rotation3, spawntimesecs, animprogress, state) VALUES
-- chairs
(700000, 160415, 628, 3, 1, 1117.19, -365.674, 18.8456, 0.968657, 0, 0, 0, 0, 0, 0, 0),
(700001, 195418, 628, 3, 1, 632.156, -304.503, 5.4879, 1.15603, 0, 0, 0, 0, 0, 0, 0),
(700002, 195416, 628, 3, 1, 643.86, -270.204, 5.48898, 2.36903, 0, 0, 0, 0, 0, 0, 0),
(700003, 160410, 628, 3, 1, 902.234, -455.508, 18.3935, -1.00356, 0, 0, 0, 0, 0, 0, 0),
(700004, 160410, 628, 3, 1, 1066.19, -337.214, 18.8225, 0.453785, 0, 0, 0, 0, 0, 0, 0),
(700005, 160418, 628, 3, 1, 810.237, -461.2, 25.4627, 1.5708, 0, 0, 0, 0, 0, 0, 0),
(700006, 160416, 628, 3, 1, 798.324, -444.951, 22.5601, -1.02102, 0, 0, 0, 0, 0, 0, 0),
(700007, 160416, 628, 3, 1, 1081.81, -358.637, 18.5531, 1.92859, 0, 0, 0, 0, 0, 0, 0),
(700008, 160419, 628, 3, 1, 814.931, -470.816, 33.6373, -3.12412, 0, 0, 0, 0, 0, 0, 0),
(700009, 195410, 628, 3, 1, 632.876, -282.461, 5.45364, -0.851094, 0, 0, 0, 0, 0, 0, 0),
(700010, 195414, 628, 3, 1, 635.796, -276.295, 5.48659, -3.03273, 0, 0, 0, 0, 0, 0, 0),
(700011, 160415, 628, 3, 1, 762.245, -444.795, 22.8526, -1.98095, 0, 0, 0, 0, 0, 0, 0),
-- flagpoles
(700012, 195131, 628, 3, 1, 1269.5, -400.809, 37.6253, -1.74278, 0, 0, 0, 0, 0, 0, 0),
(700013, 195131, 628, 3, 1, 726.385, -360.205, 17.8153, -1.6057, 0, 0, 0, 0, 0, 0, 0),
(700014, 195131, 628, 3, 1, 807.78, -1000.07, 132.381, -1.91986, 0, 0, 0, 0, 0, 0, 0),
(700015, 195131, 628, 3, 1, 776.229, -804.283, 6.45052, 1.6057, 0, 0, 0, 0, 0, 0, 0),
(700016, 195131, 628, 3, 1, 251.016, -1159.32, 17.2376, -2.23147, 0, 0, 0, 0, 0, 0, 0),
(700017, 195439, 628, 3, 1, 1284.76, -705.668, 48.9163, -3.08918, 0, 0, 0, 0, 0, 0, 0),
(700018, 195439, 628, 3, 1, 299.153, -784.589, 48.9162, -0.157079, 0, 0, 0, 0, 0, 0, 0),
-- stoves
(700019, 174863, 628, 3, 1, 903.291, -457.345, 18.1356, 2.23402, 0, 0, 0, 0, 0, 0, 0),
(700020, 174863, 628, 3, 1, 11068.1, -336.373, 18.5647, -2.59181, 0, 0, 0, 0, 0, 0, 0),
(700021, 160411, 628, 3, 1, 761.462, -446.684, 22.5602, 0.244344, 0, 0, 0, 0, 0, 0, 0),
(700022, 160411, 628, 3, 1, 1118.32, -363.969, 18.5532, -3.08918, 0, 0, 0, 0, 0, 0, 0),
-- bench
(700023, 186896, 628, 3, 1, 834.208, -461.826, 22.3067, 1.5708, 0, 0, 0, 0, 0, 0, 0),
(700024, 186922, 628, 3, 1, 826.153, -461.985, 22.5149, 1.5708, 0, 0, 0, 0, 0, 0, 0),
(700025, 186899, 628, 3, 1, 817.446, -470.47, 25.372, -1.56207, 0, 0, 0, 0, 0, 0, 0),
(700026, 186904, 628, 3, 1, 827.001, -474.415, 25.372, 1.57952, 0, 0, 0, 0, 0, 0, 0),
(700027, 186897, 628, 3, 1, 819.264, -461.961, 22.7614, 1.57952, 0, 0, 0, 0, 0, 0, 0),
-- bonfires
(700028, 195376, 628, 3, 1, 1162.91, -734.578, 48.8948, -2.9845, 0, 0, 0, 0, 0, 0, 0),
(700029, 195208, 628, 3, 1, 1282.34, -799.762, 87.1357, -3.13286, 0, 0, 0, 0, 0, 0, 0),
(700030, 195210, 628, 3, 1, 1358.06, -732.178, 87.1606, -3.13284, 0, 0, 0, 0, 0, 0, 0),
(700031, 195207, 628, 3, 1, 1281.76, -732.844, 87.1574, -3.13246, 0, 0, 0, 0, 0, 0, 0),
(700032, 195209, 628, 3, 1, 1358.81, -797.899, 87.2953, 3.13312, 0, 0, 0, 0, 0, 0, 0),
(700033, 195377, 628, 3, 1, 1162.21, -790.543, 48.9162, 2.27765, 0, 0, 0, 0, 0, 0, 0),
-- braziers
(700034, 195402, 628, 3, 1, 1262.21, -751.358, 48.8133, 2.26893, 0, 0, 0, 0, 0, 0, 0),
(700035, 195403, 628, 3, 1, 1262.58, -781.861, 48.8132, 2.04203, 0, 0, 0, 0, 0, 0, 0),
(700036, 195425, 628, 3, 1, 223.818, -839.352, 60.7917, 1.09083, 0, 0, 0, 0, 0, 0, 0),
(700037, 195424, 628, 3, 1, 224.277, -822.77, 60.7917, 2.06822, 0, 0, 0, 0, 0, 0, 0),
-- huge seaforium bombs
(700038, 195332, 628, 3, 1, 297.321, -851.321, 48.9163, -0.942477, 0, 0, 0, 0, 0, 0, 0),
(700039, 195332, 628, 3, 1, 298.104, -861.026, 48.9163, -2.75761, 0, 0, 0, 0, 0, 0, 0),
(700040, 195332, 628, 3, 1, 300.372, -818.733, 48.9162, 0.785397, 0, 0, 0, 0, 0, 0, 0),
(700041, 195332, 628, 3, 1, 302.135, -810.708, 48.9162, -1.0472, 0, 0, 0, 0, 0, 0, 0),
(700042, 195333, 628, 3, 1, 1268.31, -745.783, 48.9188, 0.785397, 0, 0, 0, 0, 0, 0, 0),
(700043, 195333, 628, 3, 1, 1268.51, -738.122, 48.9175, -1.0472, 0, 0, 0, 0, 0, 0, 0),
(700044, 195333, 628, 3, 1, 1273.07, -786.573, 48.9419, -0.942477, 0, 0, 0, 0, 0, 0, 0),
(700045, 195333, 628, 3, 1, 1273.85, -796.278, 48.9364, -2.75761, 0, 0, 0, 0, 0, 0, 0),

-- DYNAMIC OBJECTS

-- BANNERS, order:
--  contested
--  alli in conflict
--  horde in conflict
--  alli owned
--  horde owned

-- docks
(700050, 195157, 628, 3, 1, 726.385, -360.205, 17.8153, -1.62316, 0, 0, 0, 0, 0, 0, 1),
(700051, 180059, 628, 3, 1, 726.385, -360.205, 17.8153, -1.62316, 0, 0, 0, 0, 0, 0, 1),
(700052, 180061, 628, 3, 1, 726.385, -360.205, 17.8153, -1.62316, 0, 0, 0, 0, 0, 0, 1),
(700053, 180058, 628, 3, 1, 726.385, -360.205, 17.8153, -1.62316, 0, 0, 0, 0, 0, 0, 1),
(700054, 180060, 628, 3, 1, 726.385, -360.205, 17.8153, -1.62316, 0, 0, 0, 0, 0, 0, 1),
-- hangar
(700055, 195158, 628, 3, 1, 807.78, -1000.07, 132.381, -1.93732, 0, 0, 0, 0, 0, 0, 1),
(700056, 180059, 628, 3, 1, 807.78, -1000.07, 132.381, -1.93732, 0, 0, 0, 0, 0, 0, 1),
(700057, 180061, 628, 3, 1, 807.78, -1000.07, 132.381, -1.93732, 0, 0, 0, 0, 0, 0, 1),
(700058, 180058, 628, 3, 1, 807.78, -1000.07, 132.381, -1.93732, 0, 0, 0, 0, 0, 0, 1),
(700059, 180060, 628, 3, 1, 807.78, -1000.07, 132.381, -1.93732, 0, 0, 0, 0, 0, 0, 1),
-- workshop
(700060, 195133, 628, 3, 1, 776.229, -804.283, 6.45052, 1.6057, 0, 0, 0, 0, 0, 0, 1),
(700061, 180059, 628, 3, 1, 776.229, -804.283, 6.45052, 1.6057, 0, 0, 0, 0, 0, 0, 1),
(700062, 180061, 628, 3, 1, 776.229, -804.283, 6.45052, 1.6057, 0, 0, 0, 0, 0, 0, 1),
(700063, 180058, 628, 3, 1, 776.229, -804.283, 6.45052, 1.6057, 0, 0, 0, 0, 0, 0, 1),
(700064, 180060, 628, 3, 1, 776.229, -804.283, 6.45052, 1.6057, 0, 0, 0, 0, 0, 0, 1),
-- quarry
(700065, 195338, 628, 3, 1, 251.016, -1159.32, 17.2376, -2.25147, 0, 0, 0, 0, 0, 0, 1),
(700066, 180059, 628, 3, 1, 251.016, -1159.32, 17.2376, -2.25147, 0, 0, 0, 0, 0, 0, 1),
(700067, 180061, 628, 3, 1, 251.016, -1159.32, 17.2376, -2.25147, 0, 0, 0, 0, 0, 0, 1),
(700068, 180058, 628, 3, 1, 251.016, -1159.32, 17.2376, -2.25147, 0, 0, 0, 0, 0, 0, 1),
(700069, 180060, 628, 3, 1, 251.016, -1159.32, 17.2376, -2.25147, 0, 0, 0, 0, 0, 0, 1),
-- refinery
(700070, 195343, 628, 3, 1, 1269.5, -400.809, 37.6253, -1.76278, 0, 0, 0, 0, 0, 0, 1),
(700071, 180059, 628, 3, 1, 1269.5, -400.809, 37.6253, -1.76278, 0, 0, 0, 0, 0, 0, 1),
(700072, 180061, 628, 3, 1, 1269.5, -400.809, 37.6253, -1.76278, 0, 0, 0, 0, 0, 0, 1),
(700073, 180058, 628, 3, 1, 1269.5, -400.809, 37.6253, -1.76278, 0, 0, 0, 0, 0, 0, 1),
(700074, 180060, 628, 3, 1, 1269.5, -400.809, 37.6253, -1.76278, 0, 0, 0, 0, 0, 0, 1),

-- Keeps
--  alli contested
--  horde contested
--  alli owned
--  horde owned
-- Alli keep
(700075, 195397, 628, 3, 1, 299.153, -784.589, 48.9162, -0.157079, 0, 0, 0, 0, 0, 0, 1),
(700076, 195399, 628, 3, 1, 299.153, -784.589, 48.9162, -0.157079, 0, 0, 0, 0, 0, 0, 1),
(700077, 195396, 628, 3, 1, 299.153, -784.589, 48.9162, -0.157079, 0, 0, 0, 0, 0, 0, 1),
(700078, 195398, 628, 3, 1, 299.153, -784.589, 48.9162, -0.157079, 0, 0, 0, 0, 0, 0, 1),
-- Horde keep
(700079, 195392, 628, 3, 1, 1284.76, -705.668, 48.9163, -3.08918, 0, 0, 0, 0, 0, 0, 1),
(700080, 195394, 628, 3, 1, 1284.76, -705.668, 48.9163, -3.08918, 0, 0, 0, 0, 0, 0, 1),
(700081, 195391, 628, 3, 1, 1284.76, -705.668, 48.9163, -3.08918, 0, 0, 0, 0, 0, 0, 1),
(700082, 195393, 628, 3, 1, 1284.76, -705.668, 48.9163, -3.08918, 0, 0, 0, 0, 0, 0, 1),

-- banner auras
(700083, 180100, 628, 3, 1, 726.385, -360.205, 17.8153, -1.62316, 0, 0, 0, 0, 0, 0, 1),
(700084, 180101, 628, 3, 1, 726.385, -360.205, 17.8153, -1.62316, 0, 0, 0, 0, 0, 0, 1),
(700085, 180102, 628, 3, 1, 726.385, -360.205, 17.8153, -1.62316, 0, 0, 0, 0, 0, 0, 1),

(700086, 180100, 628, 3, 1, 807.78, -1000.07, 132.381, -1.93732, 0, 0, 0, 0, 0, 0, 1),
(700087, 180101, 628, 3, 1, 807.78, -1000.07, 132.381, -1.93732, 0, 0, 0, 0, 0, 0, 1),
(700088, 180102, 628, 3, 1, 807.78, -1000.07, 132.381, -1.93732, 0, 0, 0, 0, 0, 0, 1),

(700089, 180100, 628, 3, 1, 776.229, -804.283, 6.45052, 1.6057, 0, 0, 0, 0, 0, 0, 1),
(700090, 180101, 628, 3, 1, 776.229, -804.283, 6.45052, 1.6057, 0, 0, 0, 0, 0, 0, 1),
(700091, 180102, 628, 3, 1, 776.229, -804.283, 6.45052, 1.6057, 0, 0, 0, 0, 0, 0, 1),

(700092, 180100, 628, 3, 1, 251.016, -1159.32, 17.2376, -2.25147, 0, 0, 0, 0, 0, 0, 1),
(700093, 180101, 628, 3, 1, 251.016, -1159.32, 17.2376, -2.25147, 0, 0, 0, 0, 0, 0, 1),
(700094, 180102, 628, 3, 1, 251.016, -1159.32, 17.2376, -2.25147, 0, 0, 0, 0, 0, 0, 1),

(700095, 180100, 628, 3, 1, 1269.5, -400.809, 37.6253, -1.76278, 0, 0, 0, 0, 0, 0, 1),
(700096, 180101, 628, 3, 1, 1269.5, -400.809, 37.6253, -1.76278, 0, 0, 0, 0, 0, 0, 1),
(700097, 180102, 628, 3, 1, 1269.5, -400.809, 37.6253, -1.76278, 0, 0, 0, 0, 0, 0, 1),

(700098, 180100, 628, 3, 1, 299.153, -784.589, 48.9162, -0.157079, 0, 0, 0, 0, 0, 0, 1),
(700099, 180101, 628, 3, 1, 299.153, -784.589, 48.9162, -0.157079, 0, 0, 0, 0, 0, 0, 1),

(700100, 180100, 628, 3, 1, 1284.76, -705.668, 48.9163, -3.08918, 0, 0, 0, 0, 0, 0, 1),
(700101, 180101, 628, 3, 1, 1284.76, -705.668, 48.9163, -3.08918, 0, 0, 0, 0, 0, 0, 1),

-- tower portcullisses
(700102, 195436, 628, 3, 1, 401.024, -780.724, 49.9482, -2.52896, 0, 0, 0, 0, 0, 0, 1),
(700103, 195436, 628, 3, 1, 399.802, -885.208, 50.1939, 2.516, 0, 0, 0, 0, 0, 0, 1),
(700104, 195437, 628, 3, 1, 1156.89, -843.998, 48.6322, 0.732934, 0, 0, 0, 0, 0, 0, 1),
(700105, 195437, 628, 3, 1, 1157.05, -682.36, 48.6322, -0.829132, 0, 0, 0, 0, 0, 0, 1),
-- keep portcullisses
(700106, 195452, 628, 3, 1, 273.033, -832.199, 51.4109, -0.0261791, 0, 0, 0, 0, 0, 0, 1),
(700107, 195451, 628, 3, 1, 288.203, -832.767, 51.4681, 6.24156, 0, 0, 0, 0, 0, 0, 1),
(700108, 195223, 628, 3, 1, 1283.05, -765.878, 50.8297, -3.13286, 0, 0, 0, 0, 0, 0, 1),
-- teleports
(700109, 195315, 628, 3, 1, 324.635, -749.128, 49.3602, 0.0174525, 0, 0, 0, 0, 0, 0, 1),
(700110, 195315, 628, 3, 1, 311.92, -913.972, 48.8159, 3.08918, 0, 0, 0, 0, 0, 0, 1),
(700111, 195315, 628, 3, 1, 425.675, -857.09, 48.5104, -1.6057, 0, 0, 0, 0, 0, 0, 1),
(700112, 195316, 628, 3, 1, 323.54, -888.361, 48.9197, 0.0349063, 0, 0, 0, 0, 0, 0, 1),
(700113, 195316, 628, 3, 1, 326.285, -777.366, 49.0208, 3.12412, 0, 0, 0, 0, 0, 0, 1),
(700114, 195316, 628, 3, 1, 397.089, -859.382, 48.8993, 1.64061, 0, 0, 0, 0, 0, 0, 1),
(700115, 195314, 628, 3, 1, 1143.25, -779.599, 48.629, 1.64061, 0, 0, 0, 0, 0, 0, 1),
(700116, 195314, 628, 3, 1, 1236.53, -669.415, 48.2729, 0.104719, 0, 0, 0, 0, 0, 0, 1),
(700117, 195314, 628, 3, 1, 1235.09, -857.898, 48.9163, 3.07177, 0, 0, 0, 0, 0, 0, 1),
(700118, 195313, 628, 3, 1, 1233.27, -844.526, 48.8824, -0.0174525, 0, 0, 0, 0, 0, 0, 1),
(700119, 195313, 628, 3, 1, 1235.53, -683.872, 49.304, -3.08918, 0, 0, 0, 0, 0, 0, 1),
(700120, 195313, 628, 3, 1, 1158.76, -746.182, 48.6277, -1.51844, 0, 0, 0, 0, 0, 0, 1),
-- teleport effects
(700121, 195701, 628, 3, 1, 425.686, -857.092, 48.51, -1.62316, 0, 0, 0, 0, 0, 0, 1),
(700122, 195701, 628, 3, 1, 324.634, -749.148, 49.359, 0.0174525, 0, 0, 0, 0, 0, 0, 1),
(700123, 195701, 628, 3, 1, 311.911, -913.986, 48.8157, 3.08918, 0, 0, 0, 0, 0, 0, 1),
(700124, 195701, 628, 3, 1, 326.266, -777.347, 49.0215, 3.12412, 0, 0, 0, 0, 0, 0, 1),
(700125, 195701, 628, 3, 1, 323.55, -888.347, 48.9198, 0.0174525, 0, 0, 0, 0, 0, 0, 1),
(700126, 195701, 628, 3, 1, 397.116, -859.378, 48.8989, 1.64061, 0, 0, 0, 0, 0, 0, 1),
(700127, 195702, 628, 3, 1, 1143.25, -779.623, 48.6291, 1.62316, 0, 0, 0, 0, 0, 0, 1),
(700128, 195702, 628, 3, 1, 1158.64, -746.148, 48.6277, -1.50098, 0, 0, 0, 0, 0, 0, 1),
(700129, 195702, 628, 3, 1, 1233.25, -844.573, 48.8836, 0.0174525, 0, 0, 0, 0, 0, 0, 1),
(700130, 195702, 628, 3, 1, 1235.07, -857.957, 48.9163, 3.05433, 0, 0, 0, 0, 0, 0, 1),
(700131, 195702, 628, 3, 1, 1236.46, -669.344, 48.2684, 0.087266, 0, 0, 0, 0, 0, 0, 1),
(700132, 195702, 628, 3, 1, 1235.6, -683.806, 49.3028, -3.07177, 0, 0, 0, 0, 0, 0, 1),
-- gunship portals
(700133, 195320, 628, 3, 1, 827.958, -994.467, 134.071, 0, 0, 0, 0, 0, 0, 0, 0),
(700134, 195320, 628, 3, 1, 738.613, -1106.58, 134.745, 2.54818, 0, 0, 0, 0, 0, 0, 0),
(700135, 195320, 628, 3, 1, 672.283, -1156.99, 133.706, 1.37881, 0, 0, 0, 0, 0, 0, 0),
(700136, 195326, 628, 3, 1, 827.958, -994.467, 134.071, 0, 0, 0, 0, 0, 0, 0, 0),
(700137, 195326, 628, 3, 1, 738.613, -1106.58, 134.745, 2.54818, 0, 0, 0, 0, 0, 0, 0),
(700138, 195326, 628, 3, 1, 672.283, -1156.99, 133.706, 1.37881, 0, 0, 0, 0, 0, 0, 0),
-- seaforium bombs
(700139, 195232, 628, 3, 1, 750.601, -864.597, 13.4754, 1.93731, 0, 0, 0, 0, 0, 0, 0),
(700140, 195232, 628, 3, 1, 785.509, -864.715, 13.3993, 2.47837, 0, 0, 0, 0, 0, 0, 0),
(700141, 195237, 628, 3, 1, 750.601, -864.597, 13.4754, 1.93731, 0, 0, 0, 0, 0, 0, 0),
(700142, 195237, 628, 3, 1, 785.509, -864.715, 13.3993, 2.47837, 0, 0, 0, 0, 0, 0, 0);

DELETE FROM gameobject_battleground WHERE guid BETWEEN 700000 AND 700142;
INSERT INTO gameobject_battleground (guid, event1, event2) VALUES
(700050, 0, 0),
(700051, 0, 1),
(700052, 0, 2),
(700053, 0, 3),
(700054, 0, 4),
(700055, 1, 0),
(700056, 1, 1),
(700057, 1, 2),
(700058, 1, 3),
(700059, 1, 4),
(700060, 2, 0),
(700061, 2, 1),
(700062, 2, 2),
(700063, 2, 3),
(700064, 2, 4),
(700065, 3, 0),
(700066, 3, 1),
(700067, 3, 2),
(700068, 3, 3),
(700069, 3, 4),
(700070, 4, 0),
(700071, 4, 1),
(700072, 4, 2),
(700073, 4, 3),
(700074, 4, 4),
(700075, 5, 1),
(700076, 5, 2),
(700077, 5, 3),
(700078, 5, 4),
(700079, 6, 1),
(700080, 6, 2),
(700081, 6, 3),
(700082, 6, 4),
(700083, 0, 3),
(700084, 0, 4),
(700085, 0, 0),
(700086, 1, 3),
(700087, 1, 4),
(700088, 1, 0),
(700089, 2, 3),
(700090, 2, 4),
(700091, 2, 0),
(700092, 3, 3),
(700093, 3, 4),
(700094, 3, 0),
(700095, 4, 3),
(700096, 4, 4),
(700097, 4, 0),
(700098, 5, 3),
(700099, 5, 4),
(700100, 6, 3),
(700101, 6, 4),
(700102, 254, 0),
(700103, 254, 0),
(700104, 254, 0),
(700105, 254, 0),
(700106, 251, 0),
(700107, 251, 0),
(700108, 252, 0),
(700109, 7, 0),
(700110, 7, 0),
(700111, 7, 0),
(700112, 7, 0),
(700113, 7, 0),
(700114, 7, 0),
(700115, 7, 0),
(700116, 7, 0),
(700117, 7, 0),
(700118, 7, 0),
(700119, 7, 0),
(700120, 7, 0),
(700121, 254, 0),
(700122, 254, 0),
(700123, 254, 0),
(700124, 254, 0),
(700125, 254, 0),
(700126, 254, 0),
(700127, 254, 0),
(700128, 254, 0),
(700129, 254, 0),
(700130, 254, 0),
(700131, 254, 0),
(700132, 254, 0),
(700133, 1, 3),
(700134, 1, 3),
(700135, 1, 3),
(700136, 1, 4),
(700137, 1, 4),
(700138, 1, 4),
(700139, 2, 3),
(700140, 2, 3),
(700141, 2, 4),
(700142, 2, 4);

DELETE FROM battleground_events WHERE map = 628;
INSERT INTO battleground_events (map, event1, event2, description) VALUES
(628, 0, 0, 'Dock - Neutral'),
(628, 0, 1, 'Dock - Alliance contested'),
(628, 0, 2, 'Dock - Horde contested'),
(628, 0, 3, 'Dock - Alliance owned'),
(628, 0, 4, 'Dock - Horde owned'),
(628, 1, 0, 'Hangar - Neutral'),
(628, 1, 1, 'Hangar - Alliance contested'),
(628, 1, 2, 'Hangar - Horde contested'),
(628, 1, 3, 'Hangar - Alliance owned'),
(628, 1, 4, 'Hangar - Horde owned'),
(628, 2, 0, 'Workshop - Neutral'),
(628, 2, 1, 'Workshop - Alliance contested'),
(628, 2, 2, 'Workshop - Horde contested'),
(628, 2, 3, 'Workshop - Alliance owned'),
(628, 2, 4, 'Workshop - Horde owned'),
(628, 3, 0, 'Quarry - Neutral'),
(628, 3, 1, 'Quarry - Alliance contested'),
(628, 3, 2, 'Quarry - Horde contested'),
(628, 3, 3, 'Quarry - Alliance owned'),
(628, 3, 4, 'Quarry - Horde owned'),
(628, 4, 0, 'Refinery - Neutral'),
(628, 4, 1, 'Refinery - Alliance contested'),
(628, 4, 2, 'Refinery - Horde contested'),
(628, 4, 3, 'Refinery - Alliance owned'),
(628, 4, 4, 'Refinery - Horde owned'),
(628, 5, 1, 'Alli keep - Alliance contested'),
(628, 5, 2, 'Alli keep - Horde contested'),
(628, 5, 3, 'Alli keep - Alliance owned'),
(628, 5, 4, 'Alli keep - Horde owned'),
(628, 6, 1, 'Horde keep - Alliance contested'),
(628, 6, 2, 'Horde keep - Horde contested'),
(628, 6, 3, 'Horde keep - Alliance owned'),
(628, 6, 4, 'Horde keep - Horde owned'),
(628, 7, 0, 'Base teleport spawn'),
(628, 8, 0, 'Npcs'),
(628, 9, 0, 'Alli Boss guards'),
(628, 10, 0, 'Horde Boss guards'),
(628, 11, 0, 'Alli Boss'),
(628, 12, 0, 'Horde Boss'),
(628, 251, 0, 'Alli Boss gate'),
(628, 252, 0, 'Horde Boss gate'),
(628, 254, 0, 'Door');

-- DYNAMIC CREATURES

DELETE FROM creature WHERE map = 628;
INSERT INTO creature (guid, id, map, spawnMask, phaseMask, modelid, equipment_id, position_x, position_y, position_z, orientation, spawntimesecs, spawndist, currentwaypoint, curhealth, curmana, DeathState, MovementType) VALUES
-- workshop siege engines
(700000, 34776, 628, 3, 1, 0, 0, 773.680542, -884.092041, 16.8090363, 1.58824956, 0, 0, 0, 250000, 0, 0, 0),
(700001, 35069, 628, 3, 1, 0, 0, 773.680542, -884.092041, 16.8090363, 1.58824956, 0, 0, 0, 250000, 0, 0, 0),
-- workshop demolishers
(700002, 34775, 628, 3, 1, 0, 0, 751.8281, -852.732666, 12.5250978, 1.46607661, 0, 0, 0, 70000, 0, 0, 0),
(700003, 34775, 628, 3, 1, 0, 0, 761.809, -854.2274, 12.5263243, 1.46607661, 0, 0, 0, 70000, 0, 0, 0),
(700004, 34775, 628, 3, 1, 0, 0, 783.4722, -853.9601, 12.54775, 1.71042264, 0, 0, 0, 70000, 0, 0, 0),
(700005, 34775, 628, 3, 1, 0, 0, 793.055542, -852.71875, 12.5671329, 1.71042264, 0, 0, 0, 70000, 0, 0, 0),
(700006, 34775, 628, 3, 1, 0, 0, 751.8281, -852.732666, 12.5250978, 1.46607661, 0, 0, 0, 70000, 0, 0, 0),
(700007, 34775, 628, 3, 1, 0, 0, 761.809, -854.2274, 12.5263243, 1.46607661, 0, 0, 0, 70000, 0, 0, 0),
(700008, 34775, 628, 3, 1, 0, 0, 783.4722, -853.9601, 12.54775, 1.71042264, 0, 0, 0, 70000, 0, 0, 0),
(700009, 34775, 628, 3, 1, 0, 0, 793.055542, -852.71875, 12.5671329, 1.71042264, 0, 0, 0, 70000, 0, 0, 0),
-- dock glaive throwers
(700010, 34802, 628, 3, 1, 0, 0, 779.3125, -342.972229, 12.2104874, 4.712389, 0, 0, 0, 50000, 0, 0, 0),
(700011, 34802, 628, 3, 1, 0, 0, 790.029541, -342.899323, 12.2128582, 4.71238, 0, 0, 0, 50000, 0, 0, 0),
(700012, 35273, 628, 3, 1, 0, 0, 779.3125, -342.972229, 12.2104874, 4.712389, 0, 0, 0, 50000, 0, 0, 0),
(700013, 35273, 628, 3, 1, 0, 0, 790.029541, -342.899323, 12.2128582, 4.71238, 0, 0, 0, 50000, 0, 0, 0),
-- dock catapults
(700014, 34793, 628, 3, 1, 0, 0, 757.283, -341.7795, 12.2113762, 4.729842, 0, 0, 0, 15000, 0, 0, 0),
(700015, 34793, 628, 3, 1, 0, 0, 766.947937, -342.053833, 12.2009945, 4.694, 0, 0, 0, 15000, 0, 0, 0),
(700016, 34793, 628, 3, 1, 0, 0, 800.3785, -342.607635, 12.1669979, 4.6774, 0, 0, 0, 15000, 0, 0, 0),
(700017, 34793, 628, 3, 1, 0, 0, 810.7257, -342.083344, 12.1675768, 4.6600, 0, 0, 0, 15000, 0, 0, 0),
(700018, 34793, 628, 3, 1, 0, 0, 757.283, -341.7795, 12.2113762, 4.729842, 0, 0, 0, 15000, 0, 0, 0),
(700019, 34793, 628, 3, 1, 0, 0, 766.947937, -342.053833, 12.2009945, 4.694, 0, 0, 0, 15000, 0, 0, 0),
(700020, 34793, 628, 3, 1, 0, 0, 800.3785, -342.607635, 12.1669979, 4.6774, 0, 0, 0, 15000, 0, 0, 0),
(700021, 34793, 628, 3, 1, 0, 0, 810.7257, -342.083344, 12.1675768, 4.6600, 0, 0, 0, 15000, 0, 0, 0),
-- spirit guides (alli - docks, hangar, workshop, alli keep, horde keep, alli rescue point)
(700022, 13116, 628, 3, 1, 0, 0, 629.57, -279.83, 11.33, 0.0, 0, 0, 0, 24420, 4868, 0, 0),
(700023, 13116, 628, 3, 1, 0, 0, 780.729, -1103.08, 135.51, 2.27, 0, 0, 0, 24420, 4868, 0, 0),
(700024, 13116, 628, 3, 1, 0, 0, 775.74, -652.77, 9.31, 4.27, 0, 0, 0, 24420, 4868, 0, 0),
(700025, 13116, 628, 3, 1, 0, 0, 278.42, -883.20, 49.89, 1.53, 0, 0, 0, 24420, 4868, 0, 0),
(700026, 13116, 628, 3, 1, 0, 0, 1300.91, -834.04, 48.91, 1.69, 0, 0, 0, 24420, 4868, 0, 0),
(700027, 13116, 628, 3, 1, 0, 0, 438.86, -310.04, 51.81, 5.87, 0, 0, 0, 24420, 4868, 0, 0),
-- spirit guides (horde - docks, hangar, workshop, horde keep, alli keep, horde rescue point)
(700028, 13117, 628, 3, 1, 0, 0, 629.57, -279.83, 11.33, 0.0, 0, 0, 0, 24420, 4868, 0, 0),
(700029, 13117, 628, 3, 1, 0, 0, 780.729, -1103.08, 135.51, 2.27, 0, 0, 0, 24420, 4868, 0, 0),
(700030, 13117, 628, 3, 1, 0, 0, 775.74, -652.77, 9.31, 4.27, 0, 0, 0, 24420, 4868, 0, 0),
(700031, 13117, 628, 3, 1, 0, 0, 1300.91, -834.04, 48.91, 1.69, 0, 0, 0, 24420, 4868, 0, 0),
(700032, 13117, 628, 3, 1, 0, 0, 278.42, -883.20, 49.89, 1.53, 0, 0, 0, 24420, 4868, 0, 0),
(700033, 13117, 628, 3, 1, 0, 0, 1148.65, -1250.98, 16.60, 1.74, 0, 0, 0, 24420, 4868, 0, 0),
-- bosses (horde, alli)
(700034, 34922, 628, 3, 1, 0, 0, 1295.44, -765.733, 70.0541, 0.0, 0, 0, 0, 600001, 0, 0, 0),
(700035, 34924, 628, 3, 1, 0, 0, 224.983, -831.573, 60.9034, 0.0, 0, 0, 0, 600001, 0, 0, 0),
-- boss guards (4x horde, 4x alli)
(700036, 34918, 628, 3, 1, 0, 0, 1296.01, -773.256, 69.958, 0.292168, 0, 0, 0, 4608, 0, 0, 0),
(700037, 34918, 628, 3, 1, 0, 0, 1295.94, -757.756, 69.9587, 6.02165, 0, 0, 0, 4608, 0, 0, 0),
(700038, 34918, 628, 3, 1, 0, 0, 1295.09, -760.927, 69.9587, 5.94311, 0, 0, 0, 4608, 0, 0, 0),
(700039, 34918, 628, 3, 1, 0, 0, 1295.13, -769.7, 69.95, 0.34, 0, 0, 0, 4608, 0, 0, 0),
(700040, 34919, 628, 3, 1, 0, 0, 223.969, -822.958, 60.8151, 0.46337, 0, 0, 0, 4608, 0, 0, 0),
(700041, 34919, 628, 3, 1, 0, 0, 224.211, -826.952, 60.8188, 6.25961, 0, 0, 0, 4608, 0, 0, 0),
(700042, 34919, 628, 3, 1, 0, 0, 223.119, -838.386, 60.8145, 5.64857, 0, 0, 0, 4608, 0, 0, 0),
(700043, 34919, 628, 3, 1, 0, 0, 223.889, -835.102, 60.8201, 6.21642, 0, 0, 0, 4608, 0, 0, 0),
-- keep cannons
(700044, 34944, 628, 3, 1, 0, 0, 415.825, -754.634, 87.799, 1.78024, 0, 0, 0, 35000, 0, 0, 0),
(700045, 34944, 628, 3, 1, 0, 0, 410.142, -755.332, 87.7991, 1.78024, 0, 0, 0, 35000, 0, 0, 0),
(700046, 34944, 628, 3, 1, 0, 0, 424.33, -879.352, 88.0446, 0.436332, 0, 0, 0, 35000, 0, 0, 0),
(700047, 34944, 628, 3, 1, 0, 0, 425.602, -786.646, 87.7991, 5.74213, 0, 0, 0, 35000, 0, 0, 0),
(700048, 34944, 628, 3, 1, 0, 0, 426.743, -884.939, 87.9613, 0.436332, 0, 0, 0, 35000, 0, 0, 0),
(700049, 34944, 628, 3, 1, 0, 0, 404.736, -755.495, 87.7989, 1.78024, 0, 0, 0, 35000, 0, 0, 0),
(700050, 34944, 628, 3, 1, 0, 0, 428.375, -780.797, 87.7991, 5.79449, 0, 0, 0, 35000, 0, 0, 0),
(700051, 34944, 628, 3, 1, 0, 0, 429.175, -890.436, 88.0446, 0.436332, 0, 0, 0, 35000, 0, 0, 0),
(700052, 34944, 628, 3, 1, 0, 0, 430.872, -775.278, 87.7991, 5.88176, 0, 0, 0, 35000, 0, 0, 0),
(700053, 34944, 628, 3, 1, 0, 0, 408.056, -911.283, 88.0445, 4.64258, 0, 0, 0, 35000, 0, 0, 0),
(700054, 34944, 628, 3, 1, 0, 0, 413.609, -911.566, 88.0447, 4.66003, 0, 0, 0, 35000, 0, 0, 0),
(700055, 34944, 628, 3, 1, 0, 0, 402.554, -910.557, 88.0446, 4.57276, 0, 0, 0, 35000, 0, 0, 0),
(700056, 34944, 628, 3, 1, 0, 0, 1158.91, -660.144, 87.9332, 0.750492, 0, 0, 0, 35000, 0, 0, 0),
(700057, 34944, 628, 3, 1, 0, 0, 1156.22, -866.809, 87.8754, 5.27089, 0, 0, 0, 35000, 0, 0, 0),
(700058, 34944, 628, 3, 1, 0, 0, 1163.74, -663.67, 88.3571, 0.558505, 0, 0, 0, 35000, 0, 0, 0),
(700059, 34944, 628, 3, 1, 0, 0, 1135.18, -683.896, 88.0409, 3.9619, 0, 0, 0, 35000, 0, 0, 0),
(700060, 34944, 628, 3, 1, 0, 0, 1138.91, -836.359, 88.3728, 2.18166, 0, 0, 0, 35000, 0, 0, 0),
(700061, 34944, 628, 3, 1, 0, 0, 1162.08, -863.717, 88.358, 5.48033, 0, 0, 0, 35000, 0, 0, 0),
(700062, 34944, 628, 3, 1, 0, 0, 1167.13, -669.212, 87.9682, 0.383972, 0, 0, 0, 35000, 0, 0, 0),
(700063, 34944, 628, 3, 1, 0, 0, 1137.72, -688.517, 88.4023, 3.9619, 0, 0, 0, 35000, 0, 0, 0),
(700064, 34944, 628, 3, 1, 0, 0, 1135.29, -840.878, 88.0252, 2.30383, 0, 0, 0, 35000, 0, 0, 0),
(700065, 34944, 628, 3, 1, 0, 0, 1144.33, -833.309, 87.9268, 2.14675, 0, 0, 0, 35000, 0, 0, 0),
(700066, 34944, 628, 3, 1, 0, 0, 1135.29, -840.878, 88.0252, 2.30383, 0, 0, 0, 35000, 0, 0, 0),
(700067, 34944, 628, 3, 1, 0, 0, 1142.59, -691.946, 87.9756, 3.9619, 0, 0, 0, 35000, 0, 0, 0),
(700068, 34944, 628, 3, 1, 0, 0, 1166.13, -858.391, 87.9653, 5.63741, 0, 0, 0, 35000, 0, 0, 0);

DELETE FROM creature_battleground WHERE guid BETWEEN 700000 AND 700068;
INSERT INTO creature_battleground (guid, event1, event2) VALUES
-- siege engines
(700000 , 2 , 3),
(700001 , 2 , 4),
-- demolishers
(700002 , 2 , 3),
(700003 , 2 , 3),
(700004 , 2 , 3),
(700005 , 2 , 3),
(700006 , 2 , 4),
(700007 , 2 , 4),
(700008 , 2 , 4),
(700009 , 2 , 4),
-- glaive throwers
(700010 , 0 , 3),
(700011 , 0 , 3),
(700012 , 0 , 4),
(700013 , 0 , 4),
-- catapults
(700014 , 0 , 3),
(700015 , 0 , 3),
(700016 , 0 , 3),
(700017 , 0 , 3),
(700018 , 0 , 4),
(700019 , 0 , 4),
(700020 , 0 , 4),
(700021 , 0 , 4),
-- spirit guides
(700022 , 0 , 3),
(700023 , 1 , 3),
(700024 , 2 , 3),
(700025 , 5 , 3),
(700026 , 6 , 3),
(700028 , 0 , 4),
(700029 , 1 , 4),
(700030 , 2 , 4),
(700031 , 5 , 4),
(700032 , 6 , 4),
-- bosses
(700034 , 12 , 0),
(700035 , 11 , 0),
-- boss guards
(700036 , 10 , 0),
(700037 , 10 , 0),
(700038 , 10 , 0),
(700039 , 10 , 0),
(700040 , 9 , 0),
(700041 , 9 , 0),
(700042 , 9 , 0),
(700043 , 9 , 0),
-- keep cannons
(700044 , 8 , 0),
(700045 , 8 , 0),
(700046 , 8 , 0),
(700047 , 8 , 0),
(700048 , 8 , 0),
(700049 , 8 , 0),
(700050 , 8 , 0),
(700051 , 8 , 0),
(700052 , 8 , 0),
(700053 , 8 , 0),
(700054 , 8 , 0),
(700055 , 8 , 0),
(700056 , 8 , 0),
(700057 , 8 , 0),
(700058 , 8 , 0),
(700059 , 8 , 0),
(700060 , 8 , 0),
(700061 , 8 , 0),
(700062 , 8 , 0),
(700063 , 8 , 0),
(700064 , 8 , 0),
(700065 , 8 , 0),
(700066 , 8 , 0),
(700067 , 8 , 0),
(700068 , 8 , 0);

DELETE FROM achievement_criteria_requirement WHERE criteria_id IN (12066, 12067, 12163);
INSERT INTO achievement_criteria_requirement VALUES
(12066, 0, 0, 0),  -- A-bomb-inable
(12067, 0, 0, 0),  -- A-bomb-ination
(12163, 0, 0, 0);  -- Back Door Job

DELETE FROM `creature_transport` WHERE `map` IN (641, 642);
INSERT INTO `creature_transport` (`guid`, `entry`, `map`, `position_x`, `position_y`, `position_z`, `orientation`, `emote`) VALUES
(1, 34929, 641,  -41.7122, 23.1838, 22.5605, 1.60659, 0),
(2, 34929, 641, -31.0354, 25.1286, 21.6921, 1.60659, 0),
(3, 34929, 641, -21.4492, 25.8326, 21.6309, 1.60659, 0),
(4, 34929, 641, -12.4734, 26.321, 21.6237, 1.60659, 0),
(5, 34929, 641, -2.81125, 26.2077, 21.6566, 1.60659, 0),
(1, 34935, 642, -21.401, -31.343, 34.173, 4.62057, 0),
(2, 34935, 642, -12.1064, -31.9697, 34.3807, 4.62057, 0),
(3, 34935, 642, -2.4877, -31.9885, 34.8384, 4.62057, 0),
(4, 34935, 642, 10.2664, -32.0713, 35.7357, 4.62057, 0),
(5, 34935, 642, 19.4636, -30.794, 36.2254, 4.62057, 0);